In [1]:
%pip install pandas

Requirement already satisfied: pandas in /home/nickdg/miniconda3/envs/py10/lib/python3.10/site-packages (1.5.0)
Requirement already satisfied: python-dateutil>=2.8.1 in /home/nickdg/miniconda3/envs/py10/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/nickdg/miniconda3/envs/py10/lib/python3.10/site-packages (from pandas) (2022.4)
Requirement already satisfied: numpy>=1.21.0 in /home/nickdg/miniconda3/envs/py10/lib/python3.10/site-packages (from pandas) (1.23.3)
Requirement already satisfied: six>=1.5 in /home/nickdg/miniconda3/envs/py10/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [1]:
import pandas as pd

## DataFrame vs 2D Array, Rows and Columns

A key difference between Numpy and Pandas are in what index information they assume you'll use to query and organize the data in their data structures:

|           |        | Ordered | Named |
| :--:      | :--:   | :--:    | :-:   |
| Array     | Rows   | ✔️       |       |
| Array     | Columns| ✔️       |       |
| DataFrame | Rows   | ✔️       | ✔️     |
| DataFrame | Columns|         | ✔️     |

This reliance on named indices makes it straightforward to work with Pandas data **relationally**, thinking of each row as a specific Record with named Fields.

### Indexing Rows

Because DataFrame rows are both ordered and named, they can be indexed using either approach, and even both!  Column operations tend to be name-specific:

| Axis        | Ordered Index | Named Index    | Ordered Slice    | Named Slice              |  NamedOrdered Slice     |
| :--   | :--    | :--     | :--       | :--        | :--  |
| **Rows**    | `df.iloc[0]`  | `df.loc['John']` | `df.iloc[0:2]` or `df[0:2]`   | `df.loc[['Jim', 'John']]`  |  `df.loc['Jim':'Jenny']` or `df['Jim':'Jenny']` |
| **Columns** |        |  `df['Q1']` or `df.Q1` |  |  `df[['Q1', 'Q4']]` |    |

**Note**: Square brackets, not round brackets are used after `df.loc` and `df.iloc`.

### The Titanic Dataset

In [2]:
url = 'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv'
df = pd.read_csv(url)
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

**Exercises**: Let's experiment with selecting columns and rows of DataFrames in Pandas using the Titanic dataset:

**Example**: Select the 'embarked' column:

In [3]:
df['embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: embarked, Length: 891, dtype: object

Select the "age" column

In [4]:
df['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

Get rows 10-16

In [6]:
df[10:17]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False

Select the first 5 rows of the "sex" column

In [8]:
df.sex[:5]

0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: object

Select the "fare" column

In [9]:
df.fare

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 891, dtype: float64

Select the "survived" and "age" columns:

In [10]:
df[['survived', 'age']]

     survived   age
0           0  22.0
1           1  38.0
2           1  26.0
3           1  35.0
4           0  35.0
..        ...   ...
886         0  27.0
887         1  19.0
888         0   NaN
889         1  26.0
890         0  32.0

[891 rows x 2 columns]

Select the last 3 rows of the "alive" column

In [11]:
df[-3:]['alive']

888     no
889    yes
890     no
Name: alive, dtype: object

Select rows 5-10 of the "class" column

In [13]:
df['class'].loc[5:10]

5      Third
6      First
7      Third
8      Third
9     Second
10     Third
Name: class, dtype: object

## Summarizing / Aggregating Data in DataFrames

Pandas also supplies many different aggregation functions as methods:

```python
df.mean()
df['Column'].mean()
```

**Examples**:  mean, median, max, min, count, value_counts, unique

**Exercises**

**Example**: What is the mean ticket fare that the passengers paid on the titanic?

In [14]:
df.fare.mean()

32.204207968574636

What is the median ticket fare that the passengers paid on the titanic?

In [15]:
df.fare.median()

14.4542

How old was the oldest person on the titanic?

In [18]:
df.age.max()

80.0

What was the lowest fare paid on the titanic?

In [20]:
df.fare.min()

0.0

What proportion of the passengers were alone on the titanic? (Hint: df.mean())

In [23]:
df.alone.mean()

0.6026936026936027

What were the different (e.g. *unique*) classes on the titanic?

In [25]:
df['class'].unique()

array(['Third', 'First', 'Second'], dtype=object)

How many men and women are in the dataset? (hint: df.value_counts())

In [26]:
df.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

How many passengers are sitting in each class?

In [27]:
df['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

How many passengers of each sex are sitting in each class? (hint: value_counts() on multiple columns)

In [30]:
df[['sex', 'class']].value_counts()

sex     class
male    Third     347
female  Third     144
male    First     122
        Second    108
female  First      94
        Second     76
dtype: int64

## Transforming Data: Broadcasting Element-Wise Operations

Any transformation function can be performed on each element of a column, or even all columns of a DataFrame.  Here are several options for this approach:

Numpy-like Operator syntax with Broadcasting:
```python
df['Column1'] * 100
```

Functions-style syntax:
```python
np.sqrt(df['Column1'])
```

Special broadcasted-version of different classes' Methods:
```python
df['Column1'].str.upper()
```

****Exercises****: Let's try some of these on the titanic data:

**Example**: Make a new column called "OnTitanic", with all of the values set to True

In [36]:
df['OnTitanic'] = True
df[:3]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,OnTitanic
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,True
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,True
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,True

Make a new column called "isAdult", with True values if they were 18 or older and False if not.

In [37]:
df['isAdult'] = df['age'] >= 18
df[:3]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,OnTitanic,isAdult
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,True,True
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,True,True
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,True,True

Get everyone's age if they were still alive today (hint: Titanic sunk in 1912)

If a person was 10 when they were on the titanic, in 2022 they would be 120.

In [38]:
df['TodaysAge'] = df.age + (2022 - 1912)
df[:3]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,OnTitanic,isAdult,TodaysAge
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,True,True,132.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,True,True,148.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,True,True,136.0

Make a column called "not_survived", the opposite of the "survived" column.

In [39]:
df['not_survived'] = df.survived == False
df[:3]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,OnTitanic,isAdult,TodaysAge,not_survived
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,True,True,132.0,True
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,True,True,148.0,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,True,True,136.0,False

Make a Column called "Adjusted Fare", with the cost of a ticket in today's money:  (See https://www.in2013dollars.com/uk/inflation/1912?amount=1 for the conversion rate)

In [40]:
df['Adjusted Fare'] = 127 * df.fare
df[:3]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,OnTitanic,isAdult,TodaysAge,not_survived,Adjusted Fare
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,True,True,132.0,True,920.7500
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,True,True,148.0,False,9052.9791
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,True,True,136.0,False,1006.4750

## Querying/Filtering Data

To get rows based on their value, Pandas supports both Numpy's logical indexing for filtering rows and an SQL-like query string.  For example, to get all the rows of a dataframe that is positive for Column1:

```python
positive_rows = df['Column1'] > 0
df[positive_rows]
```

Often, this is done in a single line:

```python
df[df['Column1'] > 0]
```

**Exercises**
Let's go back to the Titanic dataset and do some data querying:

**Example**: Did the oldest passenger on the Titanic survive?

In [43]:
df[df.age == df['age'].max()].survived

630    1
Name: survived, dtype: int64

Where did the youngest passenger on the Titanic embark from?

In [47]:
df[df.age == df['age'].min()].embark_town

803    Cherbourg
Name: embark_town, dtype: object

How many passengers on the Titanic embarked from Cherbourg? (use len() to count the number of rows)

In [49]:
len(df[df.embark_town == 'Cherbourg'])

168

What is mean ticket fare for the 1st class?

In [53]:
df[df['class'] == 'First'].fare.mean()

84.1546875

 The 2nd?

In [54]:
df[df['class'] == 'Second'].fare.mean()

20.662183152173913

The 3rd?

In [55]:
df[df['class'] == 'Third'].fare.mean()

13.675550101832993

How many total people survived from Southampton?

In [60]:
df[df['embark_town'] == 'Southampton'].survived.sum()

217

From Cherbourg?

In [61]:
df[df['embark_town'] == 'Cherbourg'].survived.sum()

93

How many people from Southampton had first class tickets? (Hint: `(True) & (True)`)

In [74]:
len(df[(df['embark_town'] == 'Southampton') & (df['class'] == 'First')])

127